//Поле Лабиринта 11 х 10
// package Lee_Algorithm;

public class LabirNumb {
    public static void main(String[] args) {
        // System.out.println(mapColor(getMap())); // возращает карту
    }

    static int[][] getMap() { // двумерный массив массивов чисел
        return new int[][] {
                { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 },
                { -1, 00, 00, 00, 00, 00, 00, 00, -2, -1 },
                { -1, 00, -1, -1, -1, -1, 00, 00, 00, -1 },
                { -1, 00, 00, 00, -1, 00, 00, 00, 00, -1 },
                { -1, 00, 00, 00, -1, 00, 00, 00, 00, -1 },
                { -1, 00, 00, 00, -1, 00, 00, 00, 00, -1 },
                { -1, 00, 00, 00, -1, 00, 00, 00, 00, -1 },
                { -1, 00, -1, -1, -1, -1, -1, -1, 00, -1 },
                { -1, 00, 00, 00, 00, -1, 00, 00, 00, -1 },
                { -1, 00, 00, 00, 00, 00, 00, -2, 00, -1 },
                { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 }
        };
    }
}
